# 6 "($?63_lv+'50;+'51;5 5 %$\--$[1140=@$aatq\" a/4*DvehfbIg/\"" 3 4//*'F*Pi26^qx}318qkp16[.qx]"8=,k]x PPX~_~)"xvy"\(  7#  CO|"14"   #:7 9 7 9              z    7 222222222222222222222222                 "'" #\\
# 1"7"//['][']     ````      [>.>.?]~~)[7aatxy \#184  O@    <!--     (22)Siii/ \psddpsdoh ]##### #######++(- #### ##-[######;mxf ####xAegguEay######i#u####Ft#######MZWWW####WWWWWW zR###### # ####  #######:_a5# 202ø!},{P_<Ám/e!<ÁmOe!<É}M<ÁmS15%!!%BB44,222%!!%BBPZPYAAA4D,5P[5?4-0!<½!!22<2/!]ss1]'[kkX"204".â'_PPQss>3Ā~>1Ā~>7Ā~v 7 999993 1 7 3 1 8 1 1 55 k zzzzkf kf k zzzzzd kf k zzzzza kf bfz #z#1111#y#y#y#_#         ! 1>?7ДOq#t#>2/Wr#t#t#q#68#r#t#t#68#q#63#r#t#t#6v#>#</Wr#6}#y/===Wr#7ЯOq#>J7Д/Wr#y<Wr#>5/Wr#t#t#6y#>-=/Wr#6|#>6/Wr122! 1退           coding=utf8         @ [[[["472"?]]]]******<
# if-0//               18&1&  nthteo nthieo nthneo an-;et R[+++].----._     /112\11  ##### #######   # #    #####  #   #   #    ##### ####  ###   #### # W#W#####WW#WWWW#####W####WW###WWW####W#WW#W#####WW#WWWW#WWWWWWWWWWWWWWWWWWWW;WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWR
#6!@eD>>if 3>3*>++++++!\::    @ / 78"oo@" *1220*1220L*1211  >" 082",,,@_   2-----2########'\"'##`### ###### ######## #### ##### ####### ##### ###11  # # #### ### ##### ####### ##### ###    # # #### ### ##### #EEEEEδΘΔΔΔΘΔΘλ
# endif/*  1 1 v>>>>>>> >>">r"{\>>>>  @ 0:8:8/_}\(* [>]R 10G|'53'S 11111111\)      # ##########>>###>##>#####>>##>####>##>#>#####>>##>#####>####>>>#####>##>#>##>>##>####>>##>#####>####>>>#####>##>#>##  ## ####
#comment -[v   >>>>>>>> >>>>>>>>>>>>>>>>>>>9 @,,,"279"]>252O>"01",,@_  h$s o#      #????!?!??!??!!!!???!?!??!!?   !?!!!!!?!!!!?????!????????????????????! >>>>>>>>>>>>>>>>>>>>>>>                                
#[[/]e] x  > >>>>>>>@!:!8:6:2/_ >>>>>>>>>>>>>>>>>>>>>>>>>> ;>>>>>>>>>>>>>>>>>    11#v1cbbbzcbaaaabaca1tau@.7.8.2<axayatbubxbtcuc11
#~[! R++++++] +++++++++\++++++++++++++++++++++++++++++++++U.._+++++++._+++o+++o--ox#
####################################################################################>
 #{{{{]~*[~*  +++++++[>+++++++<-]>+._+++++._+._@]+-}}[.^+;;+;;+;;+<>;;+;;+;;+;;;;;;+;;+;;.._]}--<^>++[+++++[>+++++++<-]>._++++._+++._^<]+-+<[<=oC<=oC<._>>>>-]^>[<+++++[>++++++++++<-]>@@+.---@._+>$] '4o'6o@ )++$--![+++[>+++++++<-]>+._+++++.._>](  <<>> }<}>}[<}}<<}<<<<<}<<}<<<<}<<<}}}<}}<}}<}}<}}<}}<}}}<}}<<<<<<<<<<<}}}<}}<}}<}}<}}<}}<}}}<<<<<<<<<<}]  >>\[/>\/\>>>>>>>]>\[./>>\/\./\/>>>\./]  [[[
#-  x
#* *#p 173#*  e:1*23/5x%6E2  []-main=-[165]- ###  `. :-write(186). end_of_file. `
#`⟪`⟪\⟫9999 9 9
#/*9 999 99 9999 Mn MMM MMMMnnMnnnMnMMMMMMMnMMnnnnnMMn>MnMnnMnMnnnnnnMnMnMMMMMMMMnnMnMnnnMnMMMM             @,,, "286"_+1y2 #<"67",,@␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋'''␌`297'print quit`s'''␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␌␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋␋
#|9  
#cs 9 9999
#<<<#-->
#><meta http-equiV=X-UA-Compatible content=IE=99><!-- e$P+++++*D*+++1++1E!sss
#   
#{  
#bqbqbqLzLzLzqtqtqtTcTcTcRqRqRq TzTzTzRtRtRt MbMbMbPsPsPsTqTqTqAbAbAbTmTmTmBqBqBqMtMtMtUgUgUg
#=($?$?0l0c01k1k0l0i 0r 0h0h1d1 1 1 0e 0y0y 0mo1d0y0e0e001d0i0f 0g 0n0n1 10mo0n0t 0t0mo0f0t0g0g0f0h0r0r0i0001k10c 0c0l1111000001 1 100|_  )\
[ ' "`e```.1.0.6i]56pq["]298 .quit._[`\']put 294 bye!\` #s['];#/\\/;print 24;exit}}__END__/
###\MoOMoOMoOMoOMOOmoOMoOMoOMoOMoOMoOMoOMoOMoOMoOMoOMoOMoOMoOmOoMOomoomoOOOM e>+@+-@@@@=>+<@@@=>+<?#>;?\:-._++._++++._#/<?\>3-++._6+---2._#/++++++++++++++++++++++++++++++++++++++++++++++++._++._++++++.>!\
' WWWw;WW;WW;wv;w;;WW;wW;WW;wv;wW;W_;Ww;WW;WW;WW;WW;wW;WW;Ww;W;WW;WWWWwW;;;WWWWWWWwwwwvwWWWwWWWWwvwWWwW\WWwvwWWwWWWwvwW/Ww\WWW ho ho ho ho // ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi hi MU ([])  ({}<(((((()()())){}{})){}{})>)(({})){}{(<(<()>)({})({}<{}>({}){})>){({}[()])}}({}){}({}()<()()()>)  (<><()>){({}[()])}{  #(((()()()()())()())(()()())(()()())(()()())(()()())(()()())(()()())(()()())(()()())(()()())(()()()))  ((((((((\';  a=$(printf \\x00);b=$(echo -n $a|wc -c);case $b[1]¢ in 1?)echo 54;;1* )echo 242;;4* )echo 78;;8* )echo $((9999999999999999999>0?166:244));;0?1??)echo 50;;0* )echo 282;;* )echo 58;;esac;exit;#{IO.puts 295#)';  print (0and eval('":"&&(defined?A)&&290||(defined?pp)&&190||(defined?__dir__)&&13||"_"[0]==95&&108||109+1')or(None and(-1 %2>0and 9or 247)or 1/2and eval('hasattr(zip,"iters")and 200or\'𒁁\'=="-"and 241or 1')or 5<<64>>64or 68));"${print(g+91)}$/";exit; "$'#{print(187);exit}'$/"; #< ?>wWWsssss{}#(prin 45)(bye){{{}#}#}#(prin 199)(bye)46(8+9+9+9+9+=!)>* * * * *[[[[3+4*7*@] ] ] ]xxxxxxxxxxxxxxxxxxxxxx
###;{e=1}={e:null};console.log e&&39||180;\
__DATA__="""  
#"  \
__END__
set pr'[puts 59][exit]\'':;@echo 185 #';set pr'-';pr 89;exit
ifdef ss 
1     ! !
2   !    !
9      !!
2#
#  
#  
#  
#PLACET,2<- #2FAC,2SUB#1<- #52FAC,2SUB#2<- #32FACREADOUT,2PLEASEGIVEUPFACs wwwwwwwwwwwWWWwWWWWWwWWWWWWWwWWWWWWWWWwWWWWWWWWWWWWWWWwWWWWWWWWWWWWw W
jrzaeeaeuee_wuuwq jii_iullluiiiogr se_eeepaeeeeeeeeee;eeecisajjarpppppp ⠆⠄⡒⡆⡘😆😨😒😨💬95💬👥➡😻😹😸🙀🙀😹😼😿🙀🙀😼😼😸🙀🙀🙀🙀
👋🔢🌚🌝🌝🌚🌚🌚🌚🌚🐸🐸🐸🐸🐸🐸😂😂😂😂😂😂😂🌚🔥😂😂😂😂😂😂😂💯💩🐸🔥😂💞💩💞😂😂😂😂💞🔥🌚▲▲▲²²²²▲¡▼¡▲▲¡⎚¿⁵228¦ₔ₁₉₃2♦10♦10♦10♥☰䷩䷏䷏䷨䷏䷩䷩䷩䷩䷩䷩䷩䷩䷩䷩䷩䷩䷩⚎ֱֲֵֶֶֶֶַַַָָ  
밠밠따빠빠맣박다맣받다맣희맣희吾有一數曰二百八十一書之うんたんたんたんたんうんうんうんうんうんたんうんうんうんたんうんたんたんうんたんたんうんたんたんうんたんたんうんたんたんたんたんたんうんうんうんうんたんたんうんたんたんたんうんうんうんたんうんうんたんうんうんたんうんうんたんうんたんうんうんうんたんたんうんたんたんうんたんたんうんたんたんうんたんたんたんうんうん  
😊♈💖  ↨↑1↑↑↑↑↑↑↑↑↨21↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑↨↨↑2↨↑1↑↑↑↨↨0↑0↕→
😇♈♈  
😊♉♈  
😇♈♈  
😇♈♉  
😇♈💜  
😊♉♈  
😊📢♈  #e:>*****[[[[828+*+@+*99] ] ] ]*****<
😈♈💜  
😊📢♈  
😇♉💞  
😊📢♉🐸⠀⢃⠛⠋  
#-49,A,-1                              #
#-5,A,-1                               #
#6,A,-1                                #
#X  
#+------+XX   X       XXX
_|/0110@| X X  XXXXXXXXX X
_|/00011| X X   XXXXXXX
_|/1001 | X 
_|/1001 | 
_|/1000 | 
_|/$001 | 
#+------+  
#+    +
1   *xxxxxxx
53 x+       x x     xxx
1  x*  xxxx  xx   xx x  x
x  x  x  x  x x  x  x  xx
 +xx xxxxxxx +x xxxxxxx  xxxx
x  x   x      x   x
51  +xx        xxx
#  
1   *     x``   x  x
49 #+  xx+x=>+  x+x + x B+ ===+
#  =x x  x===  x x >8 xxx +++= +
#+  +x + x,_8=>+ xB  x+x
# =+R _*=x==  x +===+> x x    +
 x +R"12"+8=Dx B=xD +  + xxx+
#+ ``=>8=x>  x+~ x  x +x+B+
#  +====+x>~+B+= x x + x
#D~+x 8=++>8x +=   x+    +,_   +
15 + x   x  + +  xx   +  ?   ?@  %"18"_     !
1  + x   + x ++  xx   + ?@    ?
1 \+* x    +  +  x    +   +   *
1   ! x  +x   +       + ?  !  ?
1    ! x xx --... ...--  ? @ ?
x +   ++ xx  ++ ++     +
 +xxxxx  +     +
  
#= +
+ *   +
#= + *
#=**************************************************+
  +  +$$$
#>"3"O._   +// rk:start | print: "69" rk:end       +
   + ; + *
$'main' *****+ %++ %++ @@* %-- @@* %++ %++ @@*
 -+3o4o#  +
  <++"269">o+
^* *
 #+*****|
.x= #   +
,,  .=#
 #+ OOO       =#
 #^=
+`` 231 =#
#  #uuu#
,,..,.,,,,..,.,.,,..,,.,,,...,,.,,..,,,,,,..,,,.$
  
write 224;bye; 
  
 console.log 178;
  
~~~x  
main:Int  
main =248 
~~~  
literally, print 249
(print 164     (exit ) )
 ( *)
begin write         ('288'    )end.(*)
print 61
  
#<<<##>  
         print(85)
#<<<##>CO COMMENTp]] 
execute_process                            (COMMAND echo 296   )#[[
  
T:251  
E:0  
#+IDRIS: main:IO      (         );main=print 291
#ppW<#require"stdio"Stdio:write     (293  )#>;
#ceppp  ;  ;   ;
MsgBox (0,"",169   )
#cs  
Yo::=~147
::=  
You can see an x here.<<  
  
>{-<<<<<  
> 176
>> Output 1
>SET x TO 120. [0]{472454523665721469465830106052219449897}
>X x.   ;-}
>l=length$show"\0";main=print$[0,0,0,233,0,146,157]!!l{-
  
\begin{code}  
{- ;  ␉␉␉␉ 
␉
 ␉  



-}
open import IO;main = run (putStr"159" )
\end{code}
ppppppppppppp;p
# {{{ {{{ {{{ {{
#!ZZt >>END-IF
#xxxh  program-id.h.procedure
#xxxg  diVision.display 230.
#}}}f >>IF 2>2
#}}}e
#xxxd
#xx}c
#}}}b
#x}xa



